Конфигурация/Documents/ВыводЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыводЦенныхБумаг</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеЦенныхБумаг</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Comment>Сумма по бухгалтерскому учету</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупонаРынок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписыватьДебиторку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКотировки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКотировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКотировкиКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКотировкиКупона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРынокВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупонаРынокВВалютеУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиЦеныДляПереоценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ИсполнениеОбязательствПоСделке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсполнениеОбязательствПоСделке</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сделки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВыводЦенныхБумаг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
		РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииПоручения(Объект, Отказ);	
	КонецЕсли;
		
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.КорзинаЦенныхБумаг = Истина; // в этом документе всегда вкл. корзина ц/б
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();

	ЗаполнитьПодтверждениеОперацииНаСервере();		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоЦеннымБумагам",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, ДепозитарныйСчет"))
	Тогда
		Объект.ДепозитарныйСчет = Неопределено;
	КонецЕсли;
	
	АдресТаблицыСтоимостей = Неопределено;

	Если Объект.ЦенныеБумаги.Количество() > 0 Тогда
		ПересчитатьРыночнуюСтоимость = Вопрос("Пересчитать рыночную стоимость на текущую дату?", РежимДиалогаВопрос.ДаНет);
		Если ПересчитатьРыночнуюСтоимость = КодВозвратаДиалога.Да Тогда
			ПересчитатьРыночнуюСтоимость();
		КонецЕсли;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	АдресТаблицыСтоимостей = Неопределено;

	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	КонецЕсли;
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);

	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Если Объект.Рынок = ЭтаФорма.ТекущийРынок Тогда // ничего менять не нужно
		Возврат;
	КонецЕсли;
	
	// на текущий момент выбор рынка закладных возможен только в сделке
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Закладные")
		И ТипЗнч(Объект.Ссылка) <> Тип("ДокументСсылка.Сделка")
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На текущий момент допускается только покупка закладных");
		Объект.Рынок = ЭтаФорма.ТекущийРынок;
		Возврат;
	КонецЕсли;
	
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	Элементы.ЦенныеБумаги1ЦеннаяБумага.ОграничениеТипа = Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа;
	Элементы.ЦенныеБумаги2ЦеннаяБумага.ОграничениеТипа = Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа;
	
	Если ЭтаФорма.ТекущийРынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка") Тогда
		// если выбрана корзина ценных бумаг и добавлены строки корзины,
		// то после подтверждения очистим корзину
		ТребПодтверждение = Не ЭтаФорма.КорзинаЦенныхБумаг Или (ЭтаФорма.КорзинаЦенныхБумаг И Объект.ЦенныеБумаги.Количество() > 0);
		
		Если ТребПодтверждение Тогда
			Если Вопрос("Ценные бумаги и связанные с ними реквизиты будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда // возвращаем всё в зад
				Объект.Рынок = ЭтаФорма.ТекущийРынок;
				Возврат;
			Иначе
				РаботаСКорзинойЦенныхБумагКлиентСервер.ОчиститьРеквизиты(ЭтаФорма, Объект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ЭтаФорма.ТекущийРынок = Объект.Рынок;
	
	ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоручениеОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Поручение, "ПометкаУдаления") Тогда
		Если Вопрос("Пометить на удаление поручение? Документ ввода ценных бумаг будет записан и перепроведен (для проведенных)!", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СтандартнаяОбработка = Ложь;
			ПометитьНаУдалениеПоручениеНаСервере();
		КонецЕсли;	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоручениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Поручение) Тогда
		Если Вопрос("Заполнить документ на основании выбранного поручения?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьДокументНаОснованииПорученияНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ТЧ_ЦЕННЫЕ_БУМАГИ

&НаКлиенте
Процедура ЦенныеБумагиПриИзменении(Элемент)
	
	ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	
	ТаблицаФормы = ТаблицаФормыПоПодчиненномуЭлементу(Элемент);
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.СуммаБУ						= 0;
		ТекущиеДанные.ВалютаКотировки				= Неопределено;
		ТекущиеДанные.ВалютаКотировкиКупона			= Неопределено;
		ТекущиеДанные.ВидЦены						= Неопределено;
		ТекущиеДанные.СуммаРынок					= 0;
		ТекущиеДанные.СуммаКупонаРынок				= 0;
		ТекущиеДанные.СуммаРынокВВалютеУчета		= 0;
		ТекущиеДанные.СуммаКупонаРынокВВалютеУчета	= 0;
	КонецЕсли;
	
	ПересчитатьРыночнуюСтоимость(ТаблицаФормы.ТекущаяСтрока, ТаблицаФормы.Имя);
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, ТаблицаФормы.Имя, "Количество", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиКоличествоПриИзменении(Элемент)
	
	ТаблицаФормы = ТаблицаФормыПоПодчиненномуЭлементу(Элемент);
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, ТаблицаФормы.Имя, "Количество",, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1ЦенаКотировкиПриИзменении(Элемент)

	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, "ЦенныеБумаги1", "ЦенаКотировки", , Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1ЦенаКотировкиКупонаПриИзменении(Элемент)

	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, "ЦенныеБумаги1", "ЦенаКотировкиКупона", , Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1СуммаРынокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги1.ТекущиеДанные;
	ТекущиеДанные.СуммаВсегоРынок = ТекущиеДанные.СуммаРынок + ТекущиеДанные.СуммаКупонаРынок;
	
	ВалютаСуммы		= ?(ЗначениеЗаполнено(ТекущиеДанные["ВалютаКотировки"]), ТекущиеДанные["ВалютаКотировки"], ТекущиеДанные["ВалютаНоминала"]);
	ПересчетСуммыВВалютеУчета("ЦенныеБумаги1", "СуммаРынок", ВалютаСуммы, Истина);
	
	ТекущиеДанные.СуммаВсегоЗаВычетомРезервов = ТекущиеДанные.СуммаВсегоРынокВВалютеУчета - ТекущиеДанные.СуммаРезервов;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1СуммаКупонаРынокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги1.ТекущиеДанные;
	ТекущиеДанные.СуммаВсегоРынок = ТекущиеДанные.СуммаРынок + ТекущиеДанные.СуммаКупонаРынок;

	ВалютаСуммы = ?(ЗначениеЗаполнено(ТекущиеДанные["ВалютаКотировкиКупона"]), ТекущиеДанные["ВалютаКотировкиКупона"], ТекущиеДанные["ВалютаНоминала"]);
	ПересчетСуммыВВалютеУчета("ЦенныеБумаги1", "СуммаКупонаРынок", ВалютаСуммы, Истина);
	
	ТекущиеДанные.СуммаВсегоЗаВычетомРезервов = ТекущиеДанные.СуммаВсегоРынокВВалютеУчета - ТекущиеДанные.СуммаРезервов;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1СуммаРынокВВалютеУчетаПриИзменении(Элемент)
	
	ПересчитатьСуммуВсегоРынокВВалютеУчета("ЦенныеБумаги1");	

КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумаги1СуммаКупонаРынокВВалютеУчетаПриИзменении(Элемент)

	ПересчитатьСуммуВсегоРынокВВалютеУчета("ЦенныеБумаги1");	

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоЦеннымБумагам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоЦеннымБумагам(ЭтаФорма,);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)

	Если Объект.ЦенныеБумаги.Количество() > 0
		И Вопрос("После заполнения ранее введенные данные будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом

	ОшибкаРасчетаРыночнойСтоимости = Ложь;	
	
	ЦельРасчета				= ПредопределенноеЗначение("Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении");
	НастройкиОценки			= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	АдресТаблицыСтоимостей	= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + ЦельРасчета + "'", , , , ОшибкаРасчетаРыночнойСтоимости);
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлОценочнойСтоимостиПредоставленнойКлиентом(
			Объект.СчетДоверительногоУправления, Объект.Дата, Ложь, ЭтаФорма.УникальныйИдентификатор);
		Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
			ОшибкаРасчетаРыночнойСтоимости = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОшибкаРасчетаРыночнойСтоимости Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рыночная стоимость не рассчитана.");		
	КонецЕсли;
	
	// Заполняем стоимость
	
	ЗаполнитьНаСервере(Не ОшибкаРасчетаРыночнойСтоимости);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПересчитатьРыночнуюСтоимость(Команда)
	
	Если Объект.ЦенныеБумаги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Текущие значения рыночных цен будут изменены на расчетные. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	АдресТаблицыСтоимостей = Неопределено;

	ПересчитатьРыночнуюСтоимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьУчетныйАктивЕПС(Команда)
	ЗаполнитьУчетныйАктивЕПСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифровкаРасчета(Команда)
	
	СтрокаЦенныеБумаги = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если Не ТипЗнч(СтрокаЦенныеБумаги.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для облигаций");
		Возврат;
	КонецЕсли; 
	
	СписокПартий = ПолучитьСписокПартий(Объект.Ссылка, СтрокаЦенныеБумаги.ЦеннаяБумага);
	
	Если СписокПартий.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет движений по регистру ""Партии ценных бумаг""");
		Возврат;
	КонецЕсли;
	
	ЭлементСпискаПартий =  СписокПартий.ВыбратьЭлемент("Партия");
	
	Если ЭлементСпискаПартий <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
			|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС", 
			Объект.Дата, 
			Объект.Организация, 
			Объект.СчетДоверительногоУправления, 
			ЭлементСпискаПартий.Значение.Количество, 
			ЭлементСпискаПартий.Значение.СуммаКупона, 
			СтрокаЦенныеБумаги.ЦеннаяБумага, 
			ЭлементСпискаПартий.Значение.Партия, 
			ЭлементСпискаПартий.Значение.СтрокаПартии,
			ЭлементСпискаПартий.Значение.УчетныйАктивЕПС);
		ОткрытьФорму("Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗадатьВалютуКотировки(Команда)
	ИмяКорзины		= "ЦенныеБумаги1";
	ТекущиеДанные	= Элементы[ИмяКорзины].ТекущиеДанные;
	
	ВыбраннаяВалюта = ВыбратьВалюту(ТекущиеДанные.ВалютаКотировки, "Валюта котировки");
	Если ВыбраннаяВалюта <> Неопределено Тогда
		ТекущиеДанные.ВалютаКотировки = ВыбраннаяВалюта;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЦенаКотировки) Тогда 
			РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, ИмяКорзины, "ЦенаКотировки", , Истина);
		Иначе
			ПересчетСуммыВВалютеУчета(ИмяКорзины, "СуммаРынок", ВыбраннаяВалюта, Истина);
		КонецЕсли;
		
		ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗадатьВалютуКотировкиКупона(Команда)
	ИмяКорзины		= "ЦенныеБумаги1";
	ТекущиеДанные	= Элементы[ИмяКорзины].ТекущиеДанные;
	
	ВыбраннаяВалюта = ВыбратьВалюту(ТекущиеДанные.ВалютаКотировкиКупона, "Валюта котировки купона");
	Если ВыбраннаяВалюта <> Неопределено Тогда
		ТекущиеДанные.ВалютаКотировкиКупона = ВыбраннаяВалюта;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ЦенаКотировкиКупона) Тогда 
			РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма, ИмяКорзины, "ЦенаКотировкиКупона", , Истина);
		Иначе
			ПересчетСуммыВВалютеУчета(ИмяКорзины, "СуммаКупонаРынок", ВыбраннаяВалюта, Истина);
		КонецЕсли;
		
		ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьРасчет(Команда)
	
	Отказ = Ложь;	
	
	ТаблицаФормыЦенныеБумаги = Элементы.ЦенныеБумаги1;
	
	ТекущиеДанные = ТаблицаФормыЦенныеБумаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ Не ЗначениеЗаполнено(ТекущиеДанные.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , , "Объект.ЦенныеБумаги");
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	ТекущиеДанные.ЦеннаяБумага);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	ПересчитатьРыночнуюСтоимость(ТаблицаФормыЦенныеБумаги.ТекущаяСтрока, , Отказ, РасшифровкаРасчета);
	
	Если ТипЗнч(РасшифровкаРасчета) = Тип("ТабличныйДокумент") Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(ТекущиеДанные.ЦеннаяБумага) + "'");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзФайлаExcel(Команда)
	
	Если Не (ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Объект.Рынок)
		И ЗначениеЗаполнено(Объект.ДепозитарныйСчет)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для загрузки необходимо указать счет доверительного управления, рынок и депозитарный счет");
		Возврат;
	КонецЕсли;
	
	Если Объект.ЦенныеБумаги.Количество() > 0
		И Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЦенныеБумаги.Очистить();
		
	АдресВоВременномХранилище = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлExcelИПоместитьВоВременноеХранилище(ЭтаФорма.УникальныйИдентификатор);
	
	Если АдресВоВременномХранилище <> Неопределено Тогда
		ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcelНаСервере(АдресВоВременномХранилище);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиенте
Функция ТаблицаФормыПоПодчиненномуЭлементу(Элемент)
	
	ТаблицаФормы = Элемент;
	
	Пока ТипЗнч(ТаблицаФормы) <> Тип("ТаблицаФормы") Цикл
		ТаблицаФормы = ТаблицаФормы.Родитель;
	КонецЦикла;
	
	Возврат ТаблицаФормы;
	
КонецФункции

&НаКлиенте
Функция ВыбратьВалюту(Знач ТекущееЗначение, Подсказка = "")
	Если ВвестиЗначение(ТекущееЗначение, Подсказка, Тип("СправочникСсылка.Валюты")) Тогда
		Возврат ТекущееЗначение;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ПересчетСуммыВВалютеУчета(ИмяКорзины = "ЦенныеБумаги", ИмяСуммы, ВалютаСуммы, ПересчитатьРынок = Ложь)
	
	ТекущиеДанные = Элементы[ИмяКорзины].ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяСуммы + "ВВалютеУчета"]) Тогда
		Если Вопрос("Пересчитать сумму в валюте учёта?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ТекущиеДанные[ИмяСуммы + "ВВалютеУчета"] = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ТекущиеДанные[ИмяСуммы], ВалютаСуммы, Объект.Организация, Объект.Дата);
	
	Если ПересчитатьРынок Тогда
		ПересчитатьСуммуВсегоРынокВВалютеУчета(ИмяКорзины);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуВсегоРынокВВалютеУчета(ИмяКорзины)

	ТекущиеДанные = Элементы[ИмяКорзины].ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.СуммаВсегоРынокВВалютеУчета = ТекущиеДанные.СуммаРынокВВалютеУчета + ТекущиеДанные.СуммаКупонаРынокВВалютеУчета;
		ТекущиеДанные.СуммаВсегоЗаВычетомРезервов = ТекущиеДанные.СуммаВсегоРынокВВалютеУчета - ТекущиеДанные.СуммаРезервов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы 	  = Форма.Элементы;
	
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа  = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ДанныеОбъекта.Рынок);
	Элементы.ЦенныеБумаги1ЦеннаяБумага.ОграничениеТипа = Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа;
	Элементы.ЦенныеБумаги2ЦеннаяБумага.ОграничениеТипа = Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа;
	
	// в зависимости от рынка
	ЭтоРынокОблигаций = (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	
	Элементы.ЦенныеБумагиСписыватьДебиторку.Видимость = ЭтоРынокОблигаций;
	
	Элементы.ЦенныеБумаги1ГруппаКотировкаКупона.Видимость				= ЭтоРынокОблигаций;
	Элементы.ЦенныеБумаги1ГруппаСуммаКупона.Видимость					= ЭтоРынокОблигаций;
	Элементы.ЦенныеБумаги1ГруппаСуммаКупонаВВалютеУчета.Видимость		= ЭтоРынокОблигаций;
	Элементы.ЦенныеБумаги1ГруппаСуммаВсегоРынок.Видимость				= ЭтоРынокОблигаций;
	Элементы.ЦенныеБумаги1ГруппаСуммаВсегоРынокВВалютеУчета.Видимость	= ЭтоРынокОблигаций;
	Элементы.ЦенныеБумаги1ГруппаСуммаВсегоЗаВычетомРезервов.Видимость	= ЭтоРынокОблигаций;
	
	Элементы.ЦенныеБумаги2РезервПодОбесценениеКупонаНачисленный.Видимость = ЭтоРынокОблигаций;
	
	Элементы.ЦенныеБумагиУчетныйАктивЕПС.Видимость = БухгалтерскийУчет.ВедетсяУчетЕПС(ДанныеОбъекта.Дата, ДанныеОбъекта.Организация, ДанныеОбъекта.СчетДоверительногоУправления);
	
	СобственныйСчетДУ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный"));

	Элементы.ТипПередачи.Видимость = Не СобственныйСчетДУ;
	Элементы.Контрагент.АвтоОтметкаНезаполненного = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
	Элементы.Контрагент.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
		
	Элементы.ГруппаЕПС.Видимость = Форма.НеобходимоПоказатьДанныеЕПС;
	
	Элементы.Поручение.Видимость                = Не ЗначениеЗаполнено(Форма.ЗамещениеЦеннымиБумагами);
	Элементы.ЗамещениеЦеннымиБумагами.Видимость = ЗначениеЗаполнено(Форма.ЗамещениеЦеннымиБумагами);		
	
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИтоговыеСтроки(Форма)
		
	КорзинаЦенныхБумаг = Форма.Объект.ЦенныеБумаги;
	
	Итоги = Новый Структура("ИтогСуммаВсегоРынок, ИтогСуммаВсегоРынокВВалютеУчета, ИтогСуммаЕПС, ИтогСуммаНУ, ИтогСуммаКупонаЕПС, ИтогСуммаКупонаНУ, ИтогСуммаРезервов, ИтогСуммаВсегоЗаВычетомРезервов",
		КорзинаЦенныхБумаг.Итог("СуммаРынок") + КорзинаЦенныхБумаг.Итог("СуммаКупонаРынок"),
		КорзинаЦенныхБумаг.Итог("СуммаРынокВВалютеУчета") + КорзинаЦенныхБумаг.Итог("СуммаКупонаРынокВВалютеУчета"),
		КорзинаЦенныхБумаг.Итог("СуммаДвиженийЕПС"),
		КорзинаЦенныхБумаг.Итог("СуммаДвиженийНУ"),
		КорзинаЦенныхБумаг.Итог("СуммаДвиженийКупонаЕПС"),
		КорзинаЦенныхБумаг.Итог("СуммаДвиженийКупонаНУ"),
		КорзинаЦенныхБумаг.Итог("СуммаРезервов"),
		КорзинаЦенныхБумаг.Итог("СуммаВсегоЗаВычетомРезервов")
	);
	
	ЗаполнитьЗначенияСвойств(Форма, Итоги); 
	
КонецПроцедуры // ЗаполнитьИтоговыеСтроки

&НаСервере
Функция НеобходимоПоказатьДанныеЕПС()

	ВестиЕдиныйБухгалтерскийУчет = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиЕдиныйБухгалтерскийУчет");
	Если НЕ ВестиЕдиныйБухгалтерскийУчет Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПереоцениватьАктивыПередВыводом = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, "ПереоцениватьАктивыПередВыводом");
	Если НЕ ПереоцениватьАктивыПередВыводом Тогда
		Возврат Ложь;
	КонецЕсли;

	НастройкиСЧА = РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
	НастройкиЕПС = РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Если НастройкиСЧА.ВариантРасчетаОценочнойСтоимости = НастройкиЕПС.ВариантРасчетаОценочнойСтоимости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеЕПС()

	ЭтаФорма.ДанныеЕПС.Очистить();
	
	ДокументОбъект = Документы.ВыводЦенныхБумаг.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Объект);
	
	ДокументОбъект.ЦенныеБумаги.Загрузить(Объект.ЦенныеБумаги.Выгрузить());
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьРыночнуюСтоимостьЦенныхБумаг(ДокументОбъект, "ЦенныеБумаги", Неопределено, Неопределено, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	Для каждого СтрокаЦенныеБумаги Из ДокументОбъект.ЦенныеБумаги Цикл
	
		СтрокаДанныеЕПС = ЭтаФорма.ДанныеЕПС.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныеЕПС, СтрокаЦенныеБумаги);
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.ТекущийРынок = Объект.Рынок;
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыИКотировкиЦенныхБумаг(ЭтаФорма, Объект);
	
	ЗаполнитьСуммыБУНаСервере(Объект);	
	ЗаполнитьНомераСделокНаСервере();
	ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	
	НеобходимоПоказатьДанныеЕПС = НеобходимоПоказатьДанныеЕПС();
	
	Если НеобходимоПоказатьДанныеЕПС Тогда
		ЗаполнитьДанныеЕПС();
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
	КонецЕсли;
	
	ЭтаФорма.ЗамещениеЦеннымиБумагами =
		ПланыВидовХарактеристик.ДополнительныеСведения.ЗначениеДополнительнойНастройки(, "ЗамещениеЦеннымиБумагами", Объект.Ссылка);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ПометитьНаУдалениеПоручениеНаСервере() 
	
	ДанныеОбъекта = ЭтаФорма.Объект;
	Поручение     = ДанныеОбъекта.Поручение.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	Попытка
		ДанныеОбъекта.Поручение = Неопределено;
		
		Поручение.УстановитьПометкуУдаления(Истина);
		Поручение.Записать();
		
		Если ДанныеОбъекта.Проведен Тогда
			ЭтаФорма.ПриЗаписиПерепроводить = Истина;
		Иначе	
			ЭтаФорма.ПриЗаписиПерепроводить = Ложь;
		КонецЕсли;
		
		Если ЭтаФорма.Записать() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление поручение " + ДанныеОбъекта.Поручение + "! Система сообщает: " + ОписаниеОшибки());
		
	КонецПопытки;
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДокументНаОснованииПорученияНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНаСервере.ЗаполнитьНаОснованииПоручения(Объект.Поручение);            
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
		
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры // ЗаполнитьДокументНаОснованииПорученияНаСервере()

&НаСервере
Процедура ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(ИдСтрокиКорзины = Неопределено, ИмяКорзины = "ЦенныеБумаги")
	
	НомерСтрокиКорзины = ?(ИдСтрокиКорзины = Неопределено, Неопределено,
		Объект.ЦенныеБумаги.Индекс(Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиКорзины)));
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыИКотировкиЦенныхБумаг(ЭтаФорма, Объект,, НомерСтрокиКорзины);
	
	ЗаполнитьСуммыБУНаСервере(Объект, , НомерСтрокиКорзины);	
	
	ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	
КонецПроцедуры // ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере

&НаСервере
Процедура ЗаполнитьСуммыБУНаСервере(ДанныеОбъекта, ИмяКорзины = "ЦенныеБумаги", НомерСтрокиКорзины = Неопределено)
	
	Если Не ДанныеОбъекта.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСтрокиКорзины <> Неопределено Тогда // обновим только указанную строку корзины
		СтрокиЦенныеБумаги = Новый Массив();
		СтрокиЦенныеБумаги.Добавить(ДанныеОбъекта[ИмяКорзины][НомерСтрокиКорзины]);
	Иначе // обновим все строки корзины
		СтрокиЦенныеБумаги = ДанныеОбъекта[ИмяКорзины];
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета + БухПартииЦенныхБумаг.ДисконтПремияНачисленныйВВалютеУчета + БухПартииЦенныхБумаг.КорректировкаЭСПВВалютеУчета + БухПартииЦенныхБумаг.ПогашениеКупонаНеИсполненноеВСрокВВалютеУчета) КАК Сумма,
		|	БухПартииЦенныхБумаг.ВидУчета КАК ВидУчета,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета + БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК СуммаНКД,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПодОбесценениеКупона) КАК СуммаРезервовПодОбесценениеКупона,
		|	СУММА(БухПартииЦенныхБумаг.СуммаРезервовПоСомнительнымДолгам) КАК СуммаРезервовПоСомнительнымДолгам
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И БухПартииЦенныхБумаг.ВидУчета В (ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет), ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет))
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.ВидУчета";
	Запрос.УстановитьПараметр("Регистратор", ДанныеОбъекта.Ссылка); 	
	
	СуммыБУ = Запрос.Выполнить().Выгрузить();	
	
	Для Каждого СтрокаЦенныеБумаги Из СтрокиЦенныеБумаги Цикл
		
		СтрокиСуммыБУ = СуммыБУ.НайтиСтроки(Новый Структура("ЦеннаяБумага,ВидУчета", СтрокаЦенныеБумаги.ЦеннаяБумага, Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет));
		Если СтрокиСуммыБУ.Количество() > 0 И СтрокаЦенныеБумаги.Количество <> 0 Тогда
			СтрокаЦенныеБумаги.СуммаДвиженийЕПС = СтрокиСуммыБУ[0].Сумма * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			СтрокаЦенныеБумаги.СуммаДвиженийКупонаЕПС = СтрокиСуммыБУ[0].СуммаНКД * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			
			СтрокаЦенныеБумаги.СуммаРезервовПодОбесценение = СтрокиСуммыБУ[0].СуммаРезервовПодОбесценение * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			СтрокаЦенныеБумаги.СуммаРезервовПодОбесценениеКупона = СтрокиСуммыБУ[0].СуммаРезервовПодОбесценениеКупона * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			СтрокаЦенныеБумаги.СуммаРезервовПоСомнительнымДолгам = СтрокиСуммыБУ[0].СуммаРезервовПоСомнительнымДолгам * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			
			СтрокаЦенныеБумаги.СуммаРезервов = -(СтрокаЦенныеБумаги.СуммаРезервовПодОбесценение + СтрокаЦенныеБумаги.СуммаРезервовПодОбесценениеКупона + СтрокаЦенныеБумаги.СуммаРезервовПоСомнительнымДолгам);
			
			СтрокаЦенныеБумаги.СуммаВсегоЗаВычетомРезервов = СтрокаЦенныеБумаги.СуммаВсегоРынокВВалютеУчета - СтрокаЦенныеБумаги.СуммаРезервов;
			
		Иначе	
			СтрокаЦенныеБумаги.СуммаДвиженийЕПС = 0;
			СтрокаЦенныеБумаги.СуммаДвиженийКупонаЕПС = 0;
			
			СтрокаЦенныеБумаги.СуммаРезервовПодОбесценение = 0;
			СтрокаЦенныеБумаги.СуммаРезервовПодОбесценениеКупона = 0;
			СтрокаЦенныеБумаги.СуммаРезервовПоСомнительнымДолгам = 0;
			
			СтрокаЦенныеБумаги.СуммаРезервов = 0;
			
			СтрокаЦенныеБумаги.СуммаВсегоЗаВычетомРезервов = СтрокаЦенныеБумаги.СуммаВсегоРынокВВалютеУчета;
			
		КонецЕсли;
		
		СтрокиСуммыБУ = СуммыБУ.НайтиСтроки(Новый Структура("ЦеннаяБумага,ВидУчета", СтрокаЦенныеБумаги.ЦеннаяБумага, Перечисления.ВидыУчета.НалоговыйУчет));
		Если СтрокиСуммыБУ.Количество() > 0 И СтрокаЦенныеБумаги.Количество <> 0 Тогда
			СтрокаЦенныеБумаги.СуммаДвиженийНУ = СтрокиСуммыБУ[0].Сумма * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
			СтрокаЦенныеБумаги.СуммаДвиженийКупонаНУ = СтрокиСуммыБУ[0].СуммаНКД * (СтрокиСуммыБУ[0].Количество / СтрокаЦенныеБумаги.Количество);
		Иначе	
			СтрокаЦенныеБумаги.СуммаДвиженийНУ = 0;
			СтрокаЦенныеБумаги.СуммаДвиженийКупонаНУ = 0;
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетныйАктивЕПСНаСервере(Перезаполнять = Ложь)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Отказ = Ложь;
	РаботаСЦеннымиБумагами.ЗаполнитьУчетныеАктивыЕПСИПоместитьВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, 
						Объект.Дата, 
						Объект,
						Объект.ЦенныеБумаги.Выгрузить(, "ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, Количество"), "_УчетныеАктивыЕПС", Отказ);
						
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
							
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УчетныеАктивыЕПС.НомерСтроки КАК НомерСтроки,
		|	_УчетныеАктивыЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_УчетныеАктивыЕПС.Партия КАК Партия,
		|	_УчетныеАктивыЕПС.СтрокаПартии КАК СтрокаПартии,
		|	_УчетныеАктивыЕПС.Количество КАК Количество,
		|	_УчетныеАктивыЕПС.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	_УчетныеАктивыЕПС КАК _УчетныеАктивыЕПС";	
	
	Если Перезаполнять Тогда
		Объект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Объект.ЦенныеБумаги[Выборка.НомерСтроки - 1].УчетныйАктивЕПС = Выборка.УчетныйАктивЕПС;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(РассчитатьРыночнуюСтоимость = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК НомерСтроки,
		|	0 КАК Сумма,
		|	0 КАК СуммаКупона,
		|	0 КАК СуммаРынок,
		|	0 КАК СуммаКупонаРынок,
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ДепозитарныйСчет = &ДепозитарныйСчет
		|				И Рынок = &Рынок) КАК ОстаткиЦенныхБумагОстатки";
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Период", Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая));
	Иначе
		Запрос.УстановитьПараметр("Период", Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДепозитарныйСчет",             Объект.ДепозитарныйСчет);
	Запрос.УстановитьПараметр("Рынок",                        Объект.Рынок);
	
	Объект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());

	Если БухгалтерскийУчет.ВедетсяУчетЕПС(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления) Тогда
		ЗаполнитьУчетныйАктивЕПСНаСервере(Истина);	
	КонецЕсли;
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	Если РассчитатьРыночнуюСтоимость Тогда
		ПересчитатьРыночнуюСтоимостьНаСервере();
	КонецЕсли;
	
	ЗаполнитьИтоговыеСтроки(ЭтаФорма);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРыночнуюСтоимость(ИдСтрокиКорзины = Неопределено, ИмяКорзины = "ЦенныеБумаги", Отказ = Ложь, РасшифровкаРасчета = Неопределено)

	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	
	ОшибкаРасчетаРыночнойСтоимости = Ложь;
	
	ЦельРасчета				= ПредопределенноеЗначение("Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении");
	НастройкиОценки			= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + ЦельРасчета + "'", , , , ОшибкаРасчетаРыночнойСтоимости);
		
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		
		Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
			АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлОценочнойСтоимостиПредоставленнойКлиентом(
				Объект.СчетДоверительногоУправления, Объект.Дата, Ложь, ЭтаФорма.УникальныйИдентификатор);
			Если Не ЭтоАдресВременногоХранилища(АдресТаблицыСтоимостей) Тогда
				ОшибкаРасчетаРыночнойСтоимости = Истина;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		АдресТаблицыСтоимостей = Неопределено;
		
	КонецЕсли;
	
	Если ОшибкаРасчетаРыночнойСтоимости Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рыночная стоимость не рассчитана.", , , , Отказ);		
		Возврат;
	КонецЕсли;
	
	Если РасшифровкаРасчета <> Неопределено Тогда
		РасшифровкаРасчета.Вставить("ВариантРасчетаОценочнойСтоимости", НастройкиОценки.ВариантРасчетаОценочнойСтоимости);	
	КонецЕсли;
	
	// Пересчет рыночной стоимости

	ПересчитатьРыночнуюСтоимостьНаСервере(ИдСтрокиКорзины, ИмяКорзины, РасшифровкаРасчета);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьРыночнуюСтоимостьНаСервере(ИдСтрокиКорзины = Неопределено, ИмяКорзины = "ЦенныеБумаги", РасшифровкаРасчета = Неопределено)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьРыночнуюСтоимостьЦенныхБумаг(Объект, "ЦенныеБумаги", АдресТаблицыСтоимостей, ИдСтрокиКорзины, , , РасшифровкаРасчета);
	
	Если РасшифровкаРасчета = Неопределено Тогда	
	
		ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(ИдСтрокиКорзины, ИмяКорзины);
		
	Иначе
		
		#Область Формирование_отчета_по_расшифровке_расчета_стоимости_бумаги
		
		Если РасшифровкаРасчета.Операции.Количество() = 0 Тогда
			
			РасшифровкаРасчета = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + РасшифровкаРасчета.ВариантРасчетаОценочнойСтоимости + "' не реализована");	

		Иначе

			Отчет = Новый ТабличныйДокумент;
			
			ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Вариант расчета справедливой стоимости: " + РасшифровкаРасчета.ВариантРасчетаОценочнойСтоимости, , , Отчет);
			ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
			
			РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
			
			РасшифровкаРасчета = Отчет;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПартий(Регистратор, ЦеннаяБумага)
	
	СписокПартий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагРасходные.Количество КАК Количество,
		|	БухПартииЦенныхБумагРасходные.СтоимостьКупона + БухПартииЦенныхБумагРасходные.ПереоценкаКупона КАК СуммаКупона,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумагРасходные
		|		ПО БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагРасходные.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагРасходные.СтрокаПартии
		|			И (БухПартииЦенныхБумагРасходные.Регистратор = &Регистратор)
		|			И (БухПартииЦенныхБумагРасходные.ЦеннаяБумага = &ЦеннаяБумага)
		|			И (БухПартииЦенныхБумагРасходные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (БухПартииЦенныхБумагРасходные.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.ВидДвижения,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумагРасходные.Количество,
		|	БухПартииЦенныхБумагРасходные.СтоимостьКупона + БухПартииЦенныхБумагРасходные.ПереоценкаКупона,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС";

	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПартий.Добавить(Новый Структура("Партия, СтрокаПартии, Количество, СуммаКупона, УчетныйАктивЕПС", Выборка.Партия, Выборка.СтрокаПартии, Выборка.Количество, Выборка.СуммаКупона, Выборка.УчетныйАктивЕПС), Строка(Выборка.Партия) + ". Строка партии:" +  Выборка.СтрокаПартии);
	КонецЦикла;
	
	Возврат СписокПартий;
	
КонецФункции	

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcelНаСервере(АдресВоВременномХранилище)

	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	РаботаСЦеннымиБумагами.ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcel(ОбъектДокумента, АдресВоВременномХранилище);
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
	ЗаполнитьНомераСделокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомераСделокНаСервере(ДанныеСтроки = Неопределено)
	
	Если Объект.ЦенныеБумаги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки = Неопределено Тогда
		
		// Заполнение всех строк
		ЦенныеБумаги  = Объект.ЦенныеБумаги.Выгрузить( , "ЦеннаяБумага, Партия, СтрокаПартии");
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки.ЦеннаяБумага) И ЗначениеЗаполнено(ДанныеСтроки.Партия) И ДанныеСтроки.СтрокаПартии > 0 Тогда 		
		
		// Отбор по одной строке
		ЦенныеБумаги  = Объект.ЦенныеБумаги.Выгрузить( , "ЦеннаяБумага, Партия, СтрокаПартии");
		ЦенныеБумаги.Очистить();
		НоваяСтрока = ЦенныеБумаги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		
	Иначе
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЦенныеБумаги.Партия КАК Партия,
		|	ЦенныеБумаги.СтрокаПартии КАК СтрокаПартии
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	&ЦенныеБумаги КАК ЦенныеБумаги
		|ГДЕ
		|	НЕ(ЦенныеБумаги.Партия В (НЕОПРЕДЕЛЕНО, &ПустыеСсылкиПартий)
		|				И ЦенныеБумаги.СтрокаПартии = 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Партия КАК Партия,
		|	_ЦенныеБумаги.СтрокаПартии КАК СтрокаПартии,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(_ЦенныеБумаги.Партия КАК Документ.Сделка).НомерСделки, """")
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ВЫРАЗИТЬ(_ЦенныеБумаги.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание КАК Документ.Сделка).НомерСделки, """")
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.Партия) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.НомерСделки, """")
		|		КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.Партия) = ТИП(Документ.РеклассификацияАктивовЕПС)
		|			ТОГДА ЕСТЬNULL(РеклассификацияАктивовЕПСПартии.НомерСделки, """")
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерСделки
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО _ЦенныеБумаги.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И _ЦенныеБумаги.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО _ЦенныеБумаги.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И _ЦенныеБумаги.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки"); 		
	
	Запрос.УстановитьПараметр("ЦенныеБумаги",		Объект.ЦенныеБумаги.Выгрузить( , "ЦеннаяБумага, Партия, СтрокаПартии"));
	Запрос.УстановитьПараметр("ПустыеСсылкиПартий",	СистемныеФункции.ПустыеСсылкиСоставногоТипа(Метаданные.ОпределяемыеТипы.Партия.Тип));
	
	ТаблицаСНомерамиСделок = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыСНомерамиСделок Из ТаблицаСНомерамиСделок Цикл
		
		НайдСтрокиЦБ = Объект.ЦенныеБумаги.НайтиСтроки(Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", СтрокаТаблицыСНомерамиСделок.ЦеннаяБумага, СтрокаТаблицыСНомерамиСделок.Партия, СтрокаТаблицыСНомерамиСделок.СтрокаПартии));
		Если НайдСтрокиЦБ.Количество() > 0 Тогда
			НайдСтрокиЦБ[0].НомерСделки = СтрокаТаблицыСНомерамиСделок.НомерСделки;
		КонецЕсли; 
		
	КонецЦикла;
	           	
КонецПроцедуры 

&НаКлиенте
Процедура ЦенныеБумаги1ПартияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги1.ТекущиеДанные;
	
	Если Не ОчиститьНомерСделки(ТекущиеДанные) Тогда	
		ЗаполнитьНомераСделокНаСервере(Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", ТекущиеДанные.ЦеннаяБумага, ТекущиеДанные.Партия, ТекущиеДанные.СтрокаПартии));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОчиститьНомерСделки(ДанныеСтроки)
	
	Если Не (ЗначениеЗаполнено(ДанныеСтроки.ЦеннаяБумага) И ЗначениеЗаполнено(ДанныеСтроки.Партия) И ДанныеСтроки.СтрокаПартии > 0) Тогда 
		Объект.ЦенныеБумаги.НайтиПоИдентификатору(Элементы.ЦенныеБумаги1.ТекущаяСтрока).НомерСделки = "";
		Возврат Истина;
	КонецЕсли;	                                                                                         		
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЦенныеБумаги1СтрокаПартииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги1.ТекущиеДанные;
	
	Если Не ОчиститьНомерСделки(ТекущиеДанные) Тогда	
		ЗаполнитьНомераСделокНаСервере(Новый Структура("ЦеннаяБумага, Партия, СтрокаПартии", ТекущиеДанные.ЦеннаяБумага, ТекущиеДанные.Партия, ТекущиеДанные.СтрокаПартии));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
